CSI API ETABS v1
cPropLink.SetLinear Method
 Initializes a linear-type link property. If this function is called for an existing link property, all items for the property are reset to their default value.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLinear(
	string Name,
	ref bool[] DOF,
	ref bool[] Fixed,
	ref double[] Ke,
	ref double[] Ce,
	double DJ2,
	double DJ3,
	bool KeCoupled = false,
	bool CeCoupled = false,
	string Notes = "",
	string GUID = ""
)
Function SetLinear (
	Name As String,
	ByRef DOF As Boolean(),
	ByRef Fixed As Boolean(),
	ByRef Ke As Double(),
	ByRef Ce As Double(),
	DJ2 As Double,
	DJ3 As Double,
	Optional KeCoupled As Boolean = false,
	Optional CeCoupled As Boolean = false,
	Optional Notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropLink
Dim Name As String
Dim DOF As Boolean()
Dim Fixed As Boolean()
Dim Ke As Double()
Dim Ce As Double()
Dim DJ2 As Double
Dim DJ3 As Double
Dim KeCoupled As Boolean
Dim CeCoupled As Boolean
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetLinear(Name,
	DOF, Fixed, Ke, Ce, DJ2, DJ3, KeCoupled,
	CeCoupled, Notes, GUID)
int SetLinear(
	String^ Name,
	array<bool>^% DOF,
	array<bool>^% Fixed,
	array<double>^% Ke,
	array<double>^% Ce,
	double DJ2,
	double DJ3,
	bool KeCoupled = false,
	bool CeCoupled = false,
	String^ Notes = L"",
	String^ GUID = L""
)
abstract SetLinear :
        Name : string *
        DOF : bool[] byref *
        Fixed : bool[] byref *
        Ke : float[] byref *
        Ce : float[] byref *
        DJ2 : float *
        DJ3 : float *
        ?KeCoupled : bool *
        ?CeCoupled : bool *
        ?Notes : string *
        ?GUID : string
(* Defaults:
        let _KeCoupled = defaultArg KeCoupled false
        let _CeCoupled = defaultArg CeCoupled false
        let _Notes = defaultArg Notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
The name of an existing or new link property. If this is an existing property, that property is modified; otherwise, a new property is added.
DOF
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if properties exist for a specified degree of freedom.
Value | DOF
DOF(0) | U1
DOF(1) | U2
DOF(2) | U3
DOF(3) | R1
DOF(4) | R2
DOF(5) | R3
Fixed
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if the specified degree of freedom is fixed (restrained).
Value | Fixity
Fixed(0) | U1 fixity if DOF(0) = True
Fixed(1) | U2 fixity if DOF(1) = True
Fixed(2) | U3 fixity if DOF(2) = True
Fixed(3) | R1 fixity if DOF(3) = True
Fixed(4) | R2 fixity if DOF(4) = True
Fixed(5) | R3 fixity if DOF(5) = True
The term Fixed(n) applies only when DOF(n) = True
Ke
Type: System.Double[]
This is an array of stiffness terms for the link property. There are 6 terms in the array if the stiffness is uncoupled and 21 if it is coupled. The KeCoupled item indicates if the stiffness is coupled.
If the stiffness is uncoupled:
Value | Stiffness
Ke(0) | U1 [F/L]
Ke(1) | U2 [F/L]
Ke(2) | U3 [F/L]
Ke(3) | R1 [FL]
Ke(4) | R2 [FL]
Ke(5) | R3 [FL]
If the stiffness is coupled:
Value | Stiffness
Ke(0) | U1U1 [F/L]
Ke(1) | U1U2 [F/L]
Ke(2) | U2U2 [F/L]
Ke(3) | U1U3 [F/L]
Ke(4) | U2U3 [F/L]
Ke(5) | U3U3 [F/L]
Ke(6) | U1R1 [F]
Ke(7) | U2R1 [F]
Ke(8) | U3R1 [F]
Ke(9) | R1R1 [FL]
Ke(10) | U1R2 [F]
Ke(11) | U2R2 [F]
Ke(12) | U3R2 [F]
Ke(14) | R2R2 [FL]
Ke(15) | U1R3 [F]
Ke(16) | U2R3 [F]
Ke(17) | U3R3 [F]
Ke(18) | R1R3 [FL]
Ke(19) | R2R3 [FL]
Ke(20) | R3R3 [FL]
Ce
Type: System.Double[]
This is an array of damping terms for the link property. There are 6 terms in the array if the damping is uncoupled and 21 if it is coupled. The CeCoupled item indicates if the damping is coupled.
If the damping is uncoupled:
Value | Damping
Ce(0) | U1 [F/L]
Ce(1) | U2 [F/L]
Ce(2) | U3 [F/L]
Ce(3) | R1 [FL]
Ce(4) | R2 [FL]
Ce(5) | R3 [FL]
If the damping is coupled:
Value | Damping
Ce(0) | U1U1 [F/L]
Ce(1) | U1U2 [F/L]
Ce(2) | U2U2 [F/L]
Ce(3) | U1U3 [F/L]
Ce(4) | U2U3 [F/L]
Ce(5) | U3U3 [F/L]
Ce(6) | U1R1 [F]
Ce(7) | U2R1 [F]
Ce(8) | U3R1 [F]
Ce(9) | R1R1 [FL]
Ce(10) | U1R2 [F]
Ce(11) | U2R2 [F]
Ce(12) | U3R2 [F]
Ce(14) | R2R2 [FL]
Ce(15) | U1R3 [F]
Ce(16) | U2R3 [F]
Ce(17) | U3R3 [F]
Ce(18) | R1R3 [FL]
Ce(19) | R2R3 [FL]
Ce(20) | R3R3 [FL]
DJ2
Type: System.Double
The distance from the J-End of the link to the U2 shear spring. This item applies only when DOF(1) = True. [L]
DJ3
Type: System.Double
The distance from the J-End of the link to the U3 shear spring. This item applies only when DOF(2) = True. [L]
KeCoupled (Optional)
Type: System.Boolean
This item is True if the link stiffness, Ke, is coupled. There are 21 terms in the Ke array if Ke is coupled; otherwise there are 6 terms
CeCoupled (Optional)
Type: System.Boolean
This item is True if the link damping, Ce, is coupled. There are 21 terms in the Ce array if Ce is coupled; otherwise there are 6 terms
Notes (Optional)
Type: System.String
The notes, if any, assigned to the property.
GUID (Optional)
Type: System.String
The GUID (global unique identifier), if any, assigned to the property. If this item is input as Default, the program assigns a GUID to the property.
Return Value
Type: Int32
returns zero if the property is successfully initialized; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim DOF() As Boolean
       Dim Fixed() As Boolean
       Dim Ke() As Double
       Dim Ce() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link property
       ReDim DOF(5)
       ReDim Fixed(5)
       ReDim Ke(5)
       ReDim Ce(5)
       DOF(0) = True
       Ke(0) = 12
       ret = SapModel.PropLink.SetLinear("L1", DOF, Fixed, Ke, Ce, 0, 0)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropLink Interface
ETABSv1 Namespace